Revit 2027 API
DividedPath.MeasurementType Property
 The measurement type determines how distances are calculated. Either along a straight line between two points ('ChordLength') or along the segment of the path that connects them. ('SegmentLength').
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DividedPathMeasurementType MeasurementType { get; set; }
Public Property MeasurementType As DividedPathMeasurementType
	Get
	Set
public:
property DividedPathMeasurementType MeasurementType {
	DividedPathMeasurementType get ();
	void set (DividedPathMeasurementType value);
}
member MeasurementType : DividedPathMeasurementType with get, set
Property Value
DividedPathMeasurementType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: Invalid measurementType -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace